package my

import scala.collection.immutable.List

/**
 * my.Json.scala
 */
case class Json(json: String, res: Option[String] = Option("")) {
    def parse : Json = {
        val obj = Json.apply(json)
        obj
    }

    def list : List[List[String]] = {
        // ----------
        // test data
        // ----------
        var l = json match {
            case "{'sql':'select * from home  order by id '}" => List(
              List("0001", "東京都",  "上野・浅草・両国", "カプセルTokyo", "お誕生日プラン　現金特価　1日・1名・1泊・1円　!!!　男性専用", "1円"),
              List("0002", "沖縄県",  "那覇", "リトルアジア", "バースデー1泊1円！◆安心◆女性専用ドミトリー", "1円"),
              List("0003", "沖縄県",  "那覇", "ＣａｍＣａｍ沖縄", "★バースデイプラン★1泊1円★男性ドミトリー", "1円"),
              List("0004", "沖縄県",  "那覇", "ステラリゾート", "■1泊 1円！■誕生日の特別価格！", "1円"),
              List("0005", "沖縄県",  "那覇", "沖縄ゲストハウスけらま", "★１泊１円★男性・女性　誕生日プラン！！！", "1円"),
              List("0006", "沖縄県",  "那覇", "ロハスヴィラ", "※誕生日限定※　スペシャル価格　１泊　１円", "1円"),
              List("0007", "千葉県",  "舞浜・浦安", "ナイスインホテル舞浜東京ベイ", "★１円の日も有♪★初日のみ21時までにチェックインの方限定★舞浜駅まで車10分-徒歩２３分★お得に連泊♪", "1円"),
              List("0008", "福岡県",  "北九州", "福岡ゲストハウスリトルアジア小倉", "◆Happy Birth Day 1泊1円◆ドミトリー(相部屋)", "1円"),
              List("0009", "石川県",  "金沢", "ホテルリブマックス金沢医大前", "◇シニアバースデイプラン◇70歳以上,宿泊当日誕生日の方は宿泊料金1円！※要身分証提示", "1円"),
              List("0010", "大阪府",  "天王寺・市内南部", "ＧＵＥＳＴ　ＨＯＵＳＥ　ＭＡＴＳＵ", "【宿泊当日がお誕生日のお客様限定】お誕生日プラン！＊要身分証明書", "1円"),
              List("0011", "高知県",  "足摺・四万十", "大月エコロジーキャンプ場", "★じゃらん限定【ポイント10％】プラン！！★", "513円"),
            )
            case "{'sql':'select * from list where area=`tokyo` order by id '}" => List(
              List("0001", "東京都",  "上野・浅草・両国", "カプセルTokyo", "お誕生日プラン　現金特価　1日・1名・1泊・1円　!!!　男性専用", "1円"),
              List("0007", "千葉県",  "舞浜・浦安", "ナイスインホテル舞浜東京ベイ", "★１円の日も有♪★初日のみ21時までにチェックインの方限定★舞浜駅まで車10分-徒歩２３分★お得に連泊♪", "1円"),
            )
            case "{'sql':'select * from info where id=`0001`  '}" => List(
              List("0001", "東京都",  "上野・浅草・両国", "カプセルTokyo", "お誕生日プラン　現金特価　1日・1名・1泊・1円　!!!　男性専用", "1円", "ようこそ、1泊1980円ホテルTokyoへ、せまい、だけど清潔、快適、ネットも使える。我々1泊1980円ホテルTokyoは、ホテル運営上のあらゆるムダを省き、業界初、なんと一泊1980円という価格破壊を実践しました。", "東京都台東区下谷３－１０－１０", "東京メトロ日比谷線　入谷駅より徒歩にて約５分"),
            )
            case _ => List(
              List("0001", "東京都",  "上野・浅草・両国", "カプセルTokyo", "お誕生日プラン　現金特価　1日・1名・1泊・1円　!!!　男性専用", "1円"),
              List("0002", "沖縄県",  "那覇", "リトルアジア", "バースデー1泊1円！◆安心◆女性専用ドミトリー", "1円"),
              List("0003", "沖縄県",  "那覇", "ＣａｍＣａｍ沖縄", "★バースデイプラン★1泊1円★男性ドミトリー", "1円"),
              List("0004", "沖縄県",  "那覇", "ステラリゾート", "■1泊 1円！■誕生日の特別価格！", "1円"),
              List("0005", "沖縄県",  "那覇", "沖縄ゲストハウスけらま", "★１泊１円★男性・女性　誕生日プラン！！！", "1円"),
              List("0006", "沖縄県",  "那覇", "ロハスヴィラ", "※誕生日限定※　スペシャル価格　１泊　１円", "1円"),
              List("0007", "千葉県",  "舞浜・浦安", "ナイスインホテル舞浜東京ベイ", "★１円の日も有♪★初日のみ21時までにチェックインの方限定★舞浜駅まで車10分-徒歩２３分★お得に連泊♪", "1円"),
              List("0008", "福岡県",  "北九州", "福岡ゲストハウスリトルアジア小倉", "◆Happy Birth Day 1泊1円◆ドミトリー(相部屋)", "1円"),
              List("0009", "石川県",  "金沢", "ホテルリブマックス金沢医大前", "◇シニアバースデイプラン◇70歳以上,宿泊当日誕生日の方は宿泊料金1円！※要身分証提示", "1円"),
              List("0010", "大阪府",  "天王寺・市内南部", "ＧＵＥＳＴ　ＨＯＵＳＥ　ＭＡＴＳＵ", "【宿泊当日がお誕生日のお客様限定】お誕生日プラン！＊要身分証明書", "1円"),
              List("0011", "高知県",  "足摺・四万十", "大月エコロジーキャンプ場", "★じゃらん限定【ポイント10％】プラン！！★", "513円"),
            )
        }

        l
    }
}
